import { link } from "fs";
import { Link } from "lucide-react";

export default function knowMore() {
     const cards = [
    { title: " تحويل من كتابه الي كود", 
      description: "ميزة تحويل من كتابة إلى كود تساعد المبرمجين على تحويل الأفكار أو الأوامر المكتوبة باللغة الطبيعية مباشرة إلى كود جاهز للاستخدام. يمكن للمطورين كتابة المطلوب باللغة العربية أو الإنجليزية، والنظام يقوم تلقائيًا بإنشاء الكود المناسب بلغة البرمجة التي يختارونها، مثل Python، JavaScript، أو أي لغة أخرى. هذه الميزة توفر وقتًا كبيرًا وتقلل من الأخطاء الناتجة عن التحويل اليدوي، كما تساعد المبتدئين على التعلم بشكل أسرع، وتمكن المحترفين من تسريع عملية تطوير المشاريع. بالإضافة إلى ذلك، توفر الميزة مرونة في تخصيص الكود الناتج حسب متطلبات المشروع، مما يجعلها أداة قوية وفعّالة لكل المبرمجين.",
      link: "/convertToCode"
     },
    
    { title: " تحسين الأداء", 
      description: "ميزة تحسين الأداء  تساعد المبرمجين على رفع كفاءة التطبيقات والكود بشكل ملحوظ. تقوم هذه الميزة بتحليل الكود والبحث عن النقاط التي يمكن تحسينها لتقليل استهلاك الموارد وتسريع التنفيذ. سواء كان التطبيق بطيئًا بسبب عمليات زائدة أو كود معقد، الميزة تقترح تغييرات ذكية لجعل الأداء أكثر سلاسة واستجابة. كما تساعد في تحسين سرعة التحميل، تقليل زمن استجابة الوظائف، وتحسين تجربة المستخدم النهائي. تدعم هذه الميزة لغات برمجة متعددة وتوفر للمطورين أدوات تلقائية لتسريع عملية تحسين الأداء بدون الحاجة إلى تعديل كل سطر يدويًا.",
      link: "/ImproveCode"
     },
    { title: " مراجعة الكود", 
      description: "ميزة مراجعة الكود تساعد المبرمجين على فحص الكود المكتوب بشكل دقيق للكشف عن الأخطاء، الثغرات، والممارسات غير المثالية. تقوم هذه الميزة بتحليل الكود تلقائيًا وتقديم ملاحظات مفصلة حول كيفية تحسينه، سواء من حيث الأداء، الأمان، أو قابلية الصيانة. كما تساعد الميزة الفرق البرمجية على الحفاظ على جودة الكود الموحدة عبر المشروع، وتقليل الأخطاء قبل مرحلة الاختبار. تدعم مراجعة الكود لغات برمجة متعددة، وتوفر للمطورين إمكانية التعلم من الملاحظات المقترحة، مما يرفع مستوى الكود النهائي ويجعل المشاريع أكثر استقرارًا وكفاءة."
      ,link: "/codeReview"
    },
     { title: " مصحح الأخطاء", 
      description: "ميزة مصحح الأخطاء تمكّن المبرمجين من اكتشاف وتصحيح المشاكل في الكود بشكل سريع وفعال. تعمل هذه الميزة على فحص الكود تلقائيًا لتحديد الأخطاء البرمجية، سواء كانت أخطاء تركيبية (Syntax) أو منطقية (Logical)، وتقترح حلولًا عملية لإصلاحها. كما تساعد على تقليل الوقت المستغرق في البحث عن الأخطاء يدويًا، وتزيد من دقة وجودة الكود النهائي. تدعم هذه الميزة لغات برمجة متعددة، وتوفر للمطورين أدوات ذكية لتحليل الأخطاء وتحسين الكود، مما يجعل عملية التطوير أسرع وأكثر موثوقية، ويقلل من مشاكل التشغيل أثناء التنفيذ." 
      ,link: "/debugger"
    }
  ];

  return (
    <div className=" mt-5 flex flex-col justify-center p-4">
      <div className="grid lg:grid-cols-4  md:grid-cols-1  gap-6 w-full ">
        {cards.slice().reverse().map((card, index) => (
          <div
            key={index}
            className="bg-white shadow-2xl rounded-xl flex flex-col h-[700px] p-6 border border-[#C29A3A] ring-6 ring-[#C29A3A] hover:scale-105 transition-transform duration-300 max-h-[600px] overflow-auto"
          >
            <h2 className="text-xl font-Alexandria mb-4 text-right">{card.title}</h2>
            <p className="text-gray-700 font-Cairo text-right text-xl mt-4">{card.description}</p>
            <a href={card.link}
              className=" bg-[#556244]  text-white rounded-md px-4 py-2  hover:bg-[#445233] transition-colors duration-300 font-Alexandria text-center mt-6">
              الدخول للصفحه 
            </a>
          </div>
        ))}
      </div>
    </div>
  );
}